---
kind: other
id: Properties.T:Autodesk.Revit.DB.ModelCurveArrayIterator
source: html/b0197b96-252e-9cf8-7504-c1a3087f8b67.htm
---
# ModelCurveArrayIterator Properties

Retrieves the item that is the current focus of the iterator.